src/Openfoam/AeroSUV_mergedGeom_case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          2300;
        startFace       2083635;
    }
    outlet
    {
        type            patch;
        nFaces          2300;
        startFace       2085935;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30290;
        startFace       2088235;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          28300;
        startFace       2118525;
    }
    front
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          6509;
        startFace       2146825;
    }
    back
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          6509;
        startFace       2153334;
    }
    Geometry
    {
        type            wall;
        inGroups        1(wall);
        nFaces          9630;
        startFace       2159843;
    }
)

// ************************************************************************* //
