src/Openfoam/AeroSUV_mergedGeom_case/system/blockMeshDict
FoamFile {
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale 1.0;

vertices (
    (-4.505707 -2.489256 -0.00599866)
    (9.61496 -2.489256 -0.00599866)
    (9.61496 2.489256 -0.00599866)
    (-4.505707 2.489256 -0.00599866)
    (-4.505707 -2.489256 1.1099933)
    (9.61496 -2.489256 1.1099933)
    (9.61496 2.489256 1.1099933)
    (-4.505707 2.489256 1.1099933)
);

blocks (
    hex (0 1 2 3 4 5 6 7) (283 100 23) simpleGrading (1 1 1)
);

edges ();

boundary (
    inlet  { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    bottom { type wall; faces ((0 1 2 3)); }
    top    { type symmetryPlane; faces ((4 7 6 5)); }
    front  { type symmetryPlane; faces ((0 4 5 1)); }
    back   { type symmetryPlane; faces ((3 2 6 7)); }
);

mergePatchPairs ();
